results/4-loadtest/azure_results/azure_dotnet_800.txt
Running 1m test @ https://dotnet-matrix-linux-310-westeurope.azurewebsites.net/api/matrix
  2 threads and 800 connections
  Thread calibration: mean lat.: 3981.314ms, rate sampling interval: 12238ms
  Thread calibration: mean lat.: 4068.981ms, rate sampling interval: 12328ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.14s     6.47s   35.55s    59.53%
    Req/Sec   211.17      9.63   224.00     33.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.58s 
 75.000%   23.54s 
 90.000%   26.59s 
 99.000%   29.79s 
 99.900%   31.65s 
 99.990%   33.08s 
 99.999%   35.59s 
100.000%   35.59s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4243.455     0.000000            1         1.00
    8724.479     0.100000         2064         1.11
   11411.455     0.200000         4123         1.25
   14032.895     0.300000         6182         1.43
   16343.039     0.400000         8241         1.67
   18579.455     0.500000        10313         2.00
   19628.031     0.550000        11330         2.22
   20676.607     0.600000        12374         2.50
   21643.263     0.650000        13395         2.86
   22577.151     0.700000        14433         3.33
   23543.807     0.750000        15463         4.00
   24018.943     0.775000        15965         4.44
   24510.463     0.800000        16491         5.00
   25034.751     0.825000        17006         5.71
   25542.655     0.850000        17523         6.67
   26066.943     0.875000        18036         8.00
   26329.087     0.887500        18293         8.89
   26591.231     0.900000        18551        10.00
   26886.143     0.912500        18816        11.43
   27197.439     0.925000        19060        13.33
   27508.735     0.937500        19335        16.00
   27672.575     0.943750        19443        17.78
   27869.183     0.950000        19579        20.00
   28049.407     0.956250        19701        22.86
   28295.167     0.962500        19832        26.67
   28524.543     0.968750        19966        32.00
   28671.999     0.971875        20021        35.56
   28803.071     0.975000        20095        40.00
   28934.143     0.978125        20151        45.71
   29130.751     0.981250        20215        53.33
   29310.975     0.984375        20279        64.00
   29458.431     0.985938        20319        71.11
   29523.967     0.987500        20343        80.00
   29687.807     0.989062        20376        91.43
   29818.879     0.990625        20407       106.67
   29982.719     0.992188        20442       128.00
   30048.255     0.992969        20456       142.22
   30162.943     0.993750        20472       160.00
   30326.783     0.994531        20490       182.86
   30441.471     0.995313        20505       213.33
   30621.695     0.996094        20521       256.00
   30670.847     0.996484        20529       284.44
   30736.383     0.996875        20537       320.00
   30801.919     0.997266        20544       365.71
   30867.455     0.997656        20554       426.67
   30949.375     0.998047        20560       512.00
   31064.063     0.998242        20564       568.89
   31178.751     0.998437        20568       640.00
   31440.895     0.998633        20572       731.43
   31621.119     0.998828        20578       853.33
   31653.887     0.999023        20580      1024.00
   31768.575     0.999121        20582      1137.78
   31866.879     0.999219        20584      1280.00
   31948.799     0.999316        20586      1462.86
   32014.335     0.999414        20588      1706.67
   32047.103     0.999512        20590      2048.00
   32096.255     0.999561        20591      2275.56
   32129.023     0.999609        20592      2560.00
   32342.015     0.999658        20593      2925.71
   32374.783     0.999707        20594      3413.33
   32489.471     0.999756        20595      4096.00
   32653.311     0.999780        20596      4551.11
   32653.311     0.999805        20596      5120.00
   32849.919     0.999829        20597      5851.43
   32849.919     0.999854        20597      6826.67
   33079.295     0.999878        20598      8192.00
   33079.295     0.999890        20598      9102.22
   33079.295     0.999902        20598     10240.00
   34111.487     0.999915        20599     11702.86
   34111.487     0.999927        20599     13653.33
   34111.487     0.999939        20599     16384.00
   34111.487     0.999945        20599     18204.44
   34111.487     0.999951        20599     20480.00
   35586.047     0.999957        20600     23405.71
   35586.047     1.000000        20600          inf
#[Mean    =    18140.224, StdDeviation   =     6473.986]
#[Max     =    35553.280, Total count    =        20600]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24415 requests in 1.00m, 6.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 1480
Requests/sec:    406.89
Transfer/sec:    114.65KB